app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function loginProcess()
    {
        $username = trim($this->request->getPost('username'));
        $password = $this->request->getPost('password');

        // Check if fields are empty
        if (empty($username) || empty($password)) {
            return redirect()
                ->to(base_url('index.php/login'))
                ->with('error', 'Please enter your username and password.');
        }

        // Find user by username
        $user = $this->userModel
            ->where('username', $username)
            ->first();